app/Controllers/BarangMasuk.php

SELECT *
FROM `barangmasuk`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data = [
            'title'       => 'Transaksi Barang Masuk',
            'barangMasuk' => $this->barangMasukModel->orderBy('created_at', 'DESC')->findAll(),