app/Controllers/TransaksiServis.php

    public function index()
    {
        $data = [
            'title'           => 'Riwayat Transaksi Servis',
            'transaksiServis' => $this->transaksiServisModel->orderBy('created_at', 'DESC')->findAll(),
---
SELECT *
FROM `transaksi_servis`
ORDER BY `created_at` DESC

    public function show($faktur = null)
    {
        $header  = $this->transaksiServisModel->find($faktur);
---
SELECT *
FROM `transaksi_servis`
WHERE `transaksi_servis`.`faktur` = 'SV-20260813-003'

    public function pay()
    {
        $faktur = strtoupper(trim($this->request->getPost('faktur')));
        $header = $this->transaksiServisModel->find($faktur);
---
SELECT *
FROM `transaksi_servis`
WHERE `transaksi_servis`.`faktur` = 'SV-20260813-003'


        $kembali = $bayar - $totalHarga;

        $this->transaksiServisModel->update($faktur, [
            'status'  => 'selesai',
            'bayar'   => $bayar,
            'kembali' => $kembali,
        ]);
---
UPDATE `transaksi_servis` SET `status` = 'selesai', `bayar` = 120000, `kembali` = 0, `updated_at` = '2026-08-13 09:09:43'
WHERE `transaksi_servis`.`faktur` IN ('SV-20260813-003')

    public function cetak($faktur = null)
    {
        $header  = $this->transaksiServisModel->find($faktur);
---
SELECT *
FROM `transaksi_servis`
WHERE `transaksi_servis`.`faktur` = 'SV-20260813-003'