app/Models/DetailTransaksiServisModel.php

    public function getDetailWithInfo($faktur)
    {
        return $this->select('detail_transaksi_servis.*, servis.jenis_servis, barang.nama_barng, satuan.nama_satuan')
                    ->join('servis', 'servis.kodeservis = detail_transaksi_servis.detserviskode', 'left')
                    ->join('barang', 'barang.kode = detail_transaksi_servis.detailbrgkode', 'left')
                    ->join('satuan', 'satuan.idsatuan = barang.idsatuan', 'left')
                    ->where('detail_transaksi_servis.detfaktur', $faktur)
                    ->findAll();
---
SELECT `detail_transaksi_servis`.*, `servis`.`jenis_servis`, `barang`.`nama_barng`, `satuan`.`nama_satuan`
FROM `detail_transaksi_servis`
LEFT JOIN `servis` ON `servis`.`kodeservis` = `detail_transaksi_servis`.`detserviskode`
LEFT JOIN `barang` ON `barang`.`kode` = `detail_transaksi_servis`.`detailbrgkode`
LEFT JOIN `satuan` ON `satuan`.`idsatuan` = `barang`.`idsatuan`
WHERE `detail_transaksi_servis`.`detfaktur` = 'SV-20260813-003'